
## :white_check_mark: Apply Succeeded (push-server-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/44468)



<pre><code>Apply complete! Resources: 5 added, 2 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.aws_sqs_queue.job-queue: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-Infrastructure-Alarm-Critical]
data.aws_kms_alias.kms_alias: Reading...
data.aws_sns_topic.backend_notifications: Reading...
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-Infrastructure-Alarm-Non-Critical]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
data.aws_sqs_queue.job-queue: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/996905175585/pocket-push-queue]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
aws_cloudwatch_log_group.aws-otel-collector-log-group: Refreshing state... [id=/Backend/Push-Prod/ecs/aws-otel-collector]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=996905175585]
data.aws_sqs_queue.token-queue: Reading...
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod]
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_caller_identity.caller: Reading...
data.aws_region.region: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/Push-Prod/ecs/app]
data.aws_sqs_queue.token-queue: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/996905175585/pocket-push-feedback-queue]
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=push-prod-app]
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=Push-Prod-TaskRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=Push-Prod-TaskExecutionRole]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=2343592822]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::996905175585:policy/Push-Prod-TaskRolePolicy]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=2335216153]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::996905175585:policy/Push-Prod-TaskExecutionRolePolicy]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=push-prod-app]
data.terraform_remote_state.incident_management: Read complete after 0s
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PVSO7KM]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PZ1Z8AP]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=Push-Prod-TaskRole-20240208203930710600000004]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=Push-Prod-TaskExecutionRole-20240208203930621500000003]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=Push-Prod-TaskExecutionRole-20240208203930596000000002]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=Push-Prod]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 0s [id=PZQ6AUS]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 0s [id=PKAPG94]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 0s [id=vpc-867638e3]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-02bf7be3db7520f58]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=P7THXXC]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=PO35YN2]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=PRCTYMS]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PVOEZBF]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:service/Push-Prod/Push-Prod]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-Infrastructure-Alarm-Non-Critical:51137eeb-8293-4b66-bf51-6749746f2928]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 1s [id=us-east-1]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-Infrastructure-Alarm-Critical:48c96710-e5b9-4b34-98aa-d4b6535242e4]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=Push-Prod]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/Push-Prod/Push-Prod]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=Push-Prod-ScaleOutPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=Push-Prod-ScaleInPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=Push-Prod Service High CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=Push-Prod Service Low CPU]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511 has been deleted
  - resource "aws_appautoscaling_policy" "application_autoscaling_scale_in_policy_BF273511" {
      - arn                = "arn:aws:autoscaling:us-east-1:996905175585:scalingPolicy:c33c412d-f5e1-4ef0-8873-80651d10f960:resource/ecs/service/Push-Prod/Push-Prod:policyName/Push-Prod-ScaleInPolicy" -> null
        id                 = "Push-Prod-ScaleInPolicy"
        name               = "Push-Prod-ScaleInPolicy"
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2 has been deleted
  - resource "aws_appautoscaling_policy" "application_autoscaling_scale_out_policy_D03900A2" {
      - arn                = "arn:aws:autoscaling:us-east-1:996905175585:scalingPolicy:c33c412d-f5e1-4ef0-8873-80651d10f960:resource/ecs/service/Push-Prod/Push-Prod:policyName/Push-Prod-ScaleOutPolicy" -> null
        id                 = "Push-Prod-ScaleOutPolicy"
        name               = "Push-Prod-ScaleOutPolicy"
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99 has been deleted
  - resource "aws_appautoscaling_target" "application_autoscaling_autoscaling_target_42BF5C99" {
        id                 = "service/Push-Prod/Push-Prod"
      - resource_id        = "service/Push-Prod/Push-Prod" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null
        tags               = {}
        # (5 unchanged attributes hidden)
    }

  # aws_ecs_cluster.application_ecs_cluster_4DC6EFB3 has been deleted
  - resource "aws_ecs_cluster" "application_ecs_cluster_4DC6EFB3" {
      - arn      = "arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod" -> null
        id       = "arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod"
      - name     = "Push-Prod" -> null
        tags     = {
            "environment" = "Prod"
            "service"     = "Push"
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4 has been deleted
  - resource "aws_ecs_service" "application_ecs_service_ecs-service_A8BAB5F4" {
        id                                 = "arn:aws:ecs:us-east-1:996905175585:service/Push-Prod/Push-Prod"
      - name                               = "Push-Prod" -> null
        tags                               = {
            "environment" = "Prod"
            "service"     = "Push"
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_in_policy_BF273511" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "Push-Prod-ScaleInPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/Push-Prod/Push-Prod"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_out_policy_D03900A2" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "Push-Prod-ScaleOutPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/Push-Prod/Push-Prod"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 2
            }
        }
    }

  # aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99 will be created
  + resource "aws_appautoscaling_target" "application_autoscaling_autoscaling_target_42BF5C99" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 2
      + resource_id        = "service/Push-Prod/Push-Prod"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1 will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_in_alarm_850BE3A1" {
      ~ alarm_actions             = [] -> (known after apply)
        id                        = "Push-Prod Service Low CPU"
        tags                      = {
            "environment" = "Prod"
            "service"     = "Push"
        }
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0 will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_out_alarm_E40FCBA0" {
      ~ alarm_actions             = [] -> (known after apply)
        id                        = "Push-Prod Service High CPU"
        tags                      = {
            "environment" = "Prod"
            "service"     = "Push"
        }
        # (17 unchanged attributes hidden)
    }

  # aws_ecs_cluster.application_ecs_cluster_4DC6EFB3 will be created
  + resource "aws_ecs_cluster" "application_ecs_cluster_4DC6EFB3" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "Push-Prod"
      + tags     = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }
      + tags_all = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4 will be created
  + resource "aws_ecs_service" "application_ecs_service_ecs-service_A8BAB5F4" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "Push-Prod"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }
      + tags_all                           = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }
      + task_definition                    = "arn:aws:ecs:us-east-1:996905175585:task-definition/Push-Prod:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "ECS"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-02bf7be3db7520f58",
            ]
          + subnets          = [
              + "subnet-610bdb3b",
              + "subnet-b2a036fa",
              + "subnet-cc66bde0",
              + "subnet-d09eb8ec",
            ]
        }
    }

Plan: 5 to add, 2 to change, 0 to destroy.
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Creating...
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Still creating... [10s elapsed]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Creation complete after 11s [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Creating...
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Creation complete after 0s [id=arn:aws:ecs:us-east-1:996905175585:service/Push-Prod/Push-Prod]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Creating...
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Creation complete after 1s [id=service/Push-Prod/Push-Prod]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Creating...
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Creating...
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Creation complete after 0s [id=Push-Prod-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Modifying... [id=Push-Prod Service High CPU]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Creation complete after 0s [id=Push-Prod-ScaleInPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Modifying... [id=Push-Prod Service Low CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Modifications complete after 0s [id=Push-Prod Service High CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Modifications complete after 0s [id=Push-Prod Service Low CPU]

Apply complete! Resources: 5 added, 2 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"d320b943-8858-43f9-9440-b52b751ccb93","JobName":"push-server_infrastructure_apply_prod","PRNumber":157,"Program":"tfcmt","SHA1":"456ac15435f7e7a4ea0c81bec90fd05e9cd41460","Target":"push-server-cdk","Vars":{}} -->